#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#define вернутся_к_бывшей return
#define целка int
#define прошмандовка double
#define расстаться break
#define серьезка main
#define интрижка void
#define вывод printf
#define вайл for
#define если if
// #define N 10 - Это не надо

интрижка Постулаты_() {
    вывод("!!! КЛЁВЫЕ ФИШКИ ДЛЯ КОНТРОЛЬНОЙ :) !!!\n \
    i+=1\n \
    scanf(...) == ...\n \
    n*(-1)\n \
    int minim = INT_MAX;\n \
    minim = 1000000000;\n \
    Как вас зовут?\n \
    Оно же работает\n \
    FILE * fp = fopen(\"input.txt\", \"w\");\n \
    if (!fp) {...}\n \
    void русская_функция_которая_ищет_максимум();\n \
    Массивы без #define\n \
    Поставьте автомат\n");
}

целка целка_random(целка s, целка e);
прошмандовка frandom(прошмандовка s, прошмандовка e);
интрижка принт_аррс(целка N, целка arr[N], прошмандовка farr[N]);

целка серьезка(интрижка) {
    srand(time(NULL));
    целка нынешняя;
    scanf("%d", &нынешняя);
    целка целочка[нынешняя];
    прошмандовка давалка[нынешняя];

    целка a, b;
    прошмандовка c, d;
    scanf("%d %d %lf %lf", &a, &b, &c, &d);

    целка мужик = 0;
    вайл ( ; ; ) {
        если (мужик==нынешняя) расстаться;
        целочка[мужик] = целка_random(a, b);
        мужик+=1;
    }
    мужик = 0;
    вайл ( ; ; ) {
        если (мужик==нынешняя) расстаться;
        давалка[мужик] = frandom(c, d);
        мужик+=1;
    }
    
    принт_аррс(нынешняя, целочка, давалка);

    вернутся_к_бывшей 1;
}

интрижка принт_аррс(целка N, целка arr[N], прошмандовка farr[N]) {
    FILE * fp = fopen("output1.txt", "w");

    если (!fp) {
        exit(-1);
    }
    целка i = 0;

    вайл ( ; ; ) {
        если (i == N) расстаться;
        вывод("целочка[%d] = %d\t", i, arr[i]);
        fprintf(fp, "целочка[%d] = %d;\tдавалка[%d] = %lf\n", i, arr[i], i, farr[i]);
        i+=1;
    } 
    i = 0;
    вывод("\n");
    вайл ( ; ; ) {
        если (i == N) расстаться;
        вывод("давалка[%d] = %lf\t", i, farr[i]);
        i+=1;
    }
    // fclose(fp); - это не надо!!!
}

целка целка_random(целка s, целка e) {
    вернутся_к_бывшей rand() % (e - s + 1) + s;
}

прошмандовка frandom(прошмандовка s, прошмандовка e) {
    вернутся_к_бывшей (прошмандовка) rand() / RAND_MAX * (e - s) + s;
}